Revit 2027 API
AnalyticalMember.SetMemberForces(MemberForces) Method
 Sets Member Forces to Analytical Member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMemberForces(
	MemberForces memberForces
)
Public Sub SetMemberForces (
	memberForces As MemberForces
)
public:
void SetMemberForces(
	MemberForces^ memberForces
)
member SetMemberForces :
        memberForces : MemberForces -> unit
Parameters
memberForces MemberForces
 End to which member forces will be added is defined by setting [!:Autodesk::Revit::DB::Structure::MemberForces::Position] property in provided Member Forces object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If element already have member forces defined for that end, newly provided values replace current one. Member forces are strictly related with releases. This means that setting member forces values is reasonable only for directions that have releases set to false.
See Also
Reference
AnalyticalMember Class
SetMemberForces Overload
Autodesk.Revit.DB.Structure Namespace